Tekla.Structures.Drawing.Internal.FabricationDrawingType
Fabrication drawing type enum

Tekla.Structures.Drawing.Internal.FabricationDrawingType.Unknown
Unknown drawing type

Tekla.Structures.Drawing.Internal.FabricationDrawingType.Assembly
Assembly drawing type

Tekla.Structures.Drawing.Internal.FabricationDrawingType.CastUnit
Cast unit drawing type

Tekla.Structures.Drawing.Internal.FabricationDrawingType.SinglePart
Single part drawing type